Revit 2025 API
TagOrientationBehavior Enumeration
 This attribute describes the family orientation behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TagOrientationBehavior
Public Enumeration TagOrientationBehavior
public enum class TagOrientationBehavior
type TagOrientationBehavior
Members
Member name | Value | Description
Fixed | 0
RotateWithHost | 1
RotateAndStayUpright | 2
See Also
Reference
Autodesk.Revit.DB Namespace